---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSlantStackedWallError
source: html/ee24d681-45d2-584b-8107-d7a258930246.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSlantStackedWallError Property

Cannot slant a stacked wall with rectangular openings. Please delete the openings first.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSlantStackedWallError { get; }
```